#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_security_group.main will be created
  + resource "azurerm_network_security_group" "main" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "nsg-main-westus-01"
      + resource_group_name = "rg-vnet-main-westus-01"
      + security_rule       = (known after apply)
    }

  # azurerm_network_security_rule.http will be created
  + resource "azurerm_network_security_rule" "http" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow-HTTP"
      + network_security_group_name = "nsg-main-westus-01"
      + priority                    = 1001
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-vnet-main-westus-01"
      + source_address_prefixes     = [
          + "*",
        ]
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.https will be created
  + resource "azurerm_network_security_rule" "https" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow-HTTPS"
      + network_security_group_name = "nsg-main-westus-01"
      + priority                    = 1002
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-vnet-main-westus-01"
      + source_address_prefixes     = [
          + "*",
        ]
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.ssh will be created
  + resource "azurerm_network_security_rule" "ssh" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow-SSH"
      + network_security_group_name = "nsg-main-westus-01"
      + priority                    = 1000
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-vnet-main-westus-01"
      + source_address_prefixes     = [
          + "135.26.169.31/32",
          + "64.71.11.101/32",
          + "70.35.45.100/32",
        ]
      + source_port_range           = "*"
    }

  # azurerm_resource_group.vnet will be created
  + resource "azurerm_resource_group" "vnet" {
      + id       = (known after apply)
      + location = "westus"
      + name     = "rg-vnet-main-westus-01"
    }

  # azurerm_subnet.main will be created
  + resource "azurerm_subnet" "main" {
      + address_prefixes                              = [
          + "10.13.13.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-main-westus-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-vnet-main-westus-01"
      + virtual_network_name                          = "vnet-main-westus-01"
    }

  # azurerm_subnet_network_security_group_association.main will be created
  + resource "azurerm_subnet_network_security_group_association" "main" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.main will be created
  + resource "azurerm_virtual_network" "main" {
      + address_space                  = [
          + "10.13.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "westus"
      + name                           = "vnet-main-westus-01"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-vnet-main-westus-01"
      + subnet                         = (known after apply)
    }

  # module.vm.azurerm_linux_virtual_machine.main[0] will be created
  + resource "azurerm_linux_virtual_machine" "main" {
      + admin_username                                         = "sss-admin"
      + allow_extension_operations                             = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + custom_data                                            = (sensitive value)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "westus"
      + max_bid_price                                          = -1
      + name                                                   = "AVPDEB1"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-iaas-westus-01"
      + size                                                   = "Standard_D2s_v6"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDBfJmiHZloibeFOdFOSy6P3tdmxcsVfvxE1MYmdZd7c3fGgIEUz6l8OmyvMBvy3rpM4J+tVbLZpKLQ+Fkw2uHJ93f1TwTEv5TS4COf5lhwY1iSazuYS+KX21iyXsY4xZJT8dyq0hD6EZEmJ/wTc3VfQFi1rW0Vw7gdNVpXHTAj4Zt85U/GAUzROvuZbtFVTBqcFQyyqzs8r6MRQeqj5N57JQAs0rBefmxFPrwqOlRLe94j21KGXSqvEJ8aM3fcwwdY5IKtdr4ZHZBlk0/td6sojd/CN8eJ10jOhG7apNvHZGFnBTTxAZY2TJywU4uwRGIDHV+sGoNebdRUJS5Vw8P3xg5lkqRKrtUgEhQ87WIn+sXZmcpL9C9IaGrJh+gA9OegND8jOXmd4nCeJ+cP+rvnvOQP6k/cwXNFOBFe34v0Bek1Buqckd2uRvZ4iLBpTV286YdwuRf0t/XkHNjSu7l8wYf5Q4aKAF9XwGye6VlT+nSV3lZetqH0dFANgblBY8//eowtQF8Uf9aMk0WhbIuHrQhWZNXP7xD9ULHegWK+8chBVH9CHEZL2n5WL2YNvkJGxL0H9mLNjWh8V25YZOc/ek7Lz09KiS/oCZeQ60wG4hBUZd582r/+/s8CnJR0C/e409tRMq+H6LJ5gjI+uldZmdKQTT4QkQZLJQgRyrfAAw=="
          + username   = "sss-admin"
        }
      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDMsUjak9+rLI9fajHJJO9ghtK/PET2UzudL1Ppirw1y3115notgUxRlAeZA82PST+UeEy+vRDxYgPbBLtd7YqVKfqAsAbBWGSGOMnIlOkouA3H/MhCd9d9u/3RKpnpnmU+yWywlCD2uLUuA0+ok5aZux2hiJCeqk+BqGM1mx+zZH/48nIWK0uvGKIGpKc/Ql1az85MJXFcbyqmOJY7jzW0Or5IRBq/KUA9pfseTq2X8IU8j8QmuC8CwtdhAdkK3G1YbgCT1oyUDaBr0yr+oXOK5VvCnj9JAL/fc4WLIdCbRIE5Utal8ipX4STt39ZS30jFjMookCalOLqL/EmqGMnVRFscBnKnuor7YVQ36YAMvHnM5+yki7GE4L0AEg2/FZCnT5GMXIYqb0V71jC8UvVjh7pMLxr7gAC9WOyVQahrexbISt3aW1Y3AOTiq/7tvCRtRNlCfHzDG5Cy18aV5cPYBxYvLYqhQ8qEu8EmpNZmAfWrnUMSsDqcojhxBHe7sNT8dk3ay+k2Pejnq3muQcIeBT65reeGXPxQlwr/BcTMfwtYK0LhEMGW8k+BY/JGW0Zf1o3TX/zNn7HzJzqbPu6NXBAMz2nMHszqNM6HsKvjVX+W1R/F9AmqKbghI4YOwtozwbaDIOG/UmaZ07m+33BJq7urSPTneKAVevyNuv6Pow=="
          + username   = "sss-admin"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 64
          + id                        = (known after apply)
          + name                      = "osdisk-AVPDEB1"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "debian-13"
          + publisher = "debian"
          + sku       = "13-gen2"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.vm.azurerm_network_interface.main[0] will be created
  + resource "azurerm_network_interface" "main" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "westus"
      + mac_address                    = (known after apply)
      + name                           = "nic-AVPDEB1"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-iaas-westus-01"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "default"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = "/subscriptions/4880ac71-6ef8-445b-980b-9a11ded3af6f/resourceGroups/rg-iaas-westus-01/providers/Microsoft.Network/publicIPAddresses/pip-AVPDEB1"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.vm.azurerm_virtual_machine_data_disk_attachment.data[0] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "data" {
      + caching                   = "ReadWrite"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = "/subscriptions/4880ac71-6ef8-445b-980b-9a11ded3af6f/resourceGroups/rg-iaas-westus-01/providers/Microsoft.Compute/disks/datadisk-AVPDEB1-256gb"
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

Plan: 11 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @manrajsingh, Action: `pull_request`, Workflow: `Terraform CI/CD`*